__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to
==================================================================================================
input_1 (InputLayer)            [(None, 120, 4)]     0
__________________________________________________________________________________________________
conv1d (Conv1D)                 (None, 120, 32)      160         input_1[0][0]
__________________________________________________________________________________________________
conv1d_2 (Conv1D)               (None, 120, 32)      1056        conv1d[0][0]
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, 120, 32)      128         conv1d_2[0][0]
__________________________________________________________________________________________________
activation (Activation)         (None, 120, 32)      0           batch_normalization[0][0]
__________________________________________________________________________________________________
conv1d_3 (Conv1D)               (None, 120, 32)      11296       activation[0][0]
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 120, 32)      128         conv1d_3[0][0]
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 120, 32)      0           batch_normalization_1[0][0]
__________________________________________________________________________________________________
conv1d_4 (Conv1D)               (None, 120, 32)      1056        activation_1[0][0]
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 120, 32)      128         conv1d_4[0][0]
__________________________________________________________________________________________________
add (Add)                       (None, 120, 32)      0           batch_normalization_2[0][0]
                                                                 conv1d[0][0]
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 120, 32)      0           add[0][0]
__________________________________________________________________________________________________
conv1d_5 (Conv1D)               (None, 120, 32)      1056        activation_2[0][0]
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 120, 32)      128         conv1d_5[0][0]
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 120, 32)      0           batch_normalization_3[0][0]
__________________________________________________________________________________________________
conv1d_6 (Conv1D)               (None, 120, 32)      11296       activation_3[0][0]
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 120, 32)      128         conv1d_6[0][0]
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 120, 32)      0           batch_normalization_4[0][0]
__________________________________________________________________________________________________
conv1d_7 (Conv1D)               (None, 120, 32)      1056        activation_4[0][0]
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 120, 32)      128         conv1d_7[0][0]
__________________________________________________________________________________________________
add_1 (Add)                     (None, 120, 32)      0           batch_normalization_5[0][0]
                                                                 activation_2[0][0]
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 120, 32)      0           add_1[0][0]
__________________________________________________________________________________________________
conv1d_8 (Conv1D)               (None, 120, 32)      1056        activation_5[0][0]
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 120, 32)      128         conv1d_8[0][0]
__________________________________________________________________________________________________
activation_6 (Activation)       (None, 120, 32)      0           batch_normalization_6[0][0]
__________________________________________________________________________________________________
conv1d_9 (Conv1D)               (None, 120, 32)      11296       activation_6[0][0]
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 120, 32)      128         conv1d_9[0][0]
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 120, 32)      0           batch_normalization_7[0][0]
__________________________________________________________________________________________________
conv1d_10 (Conv1D)              (None, 120, 32)      1056        activation_7[0][0]
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 120, 32)      128         conv1d_10[0][0]
__________________________________________________________________________________________________
add_2 (Add)                     (None, 120, 32)      0           batch_normalization_8[0][0]
                                                                 activation_5[0][0]
__________________________________________________________________________________________________
activation_8 (Activation)       (None, 120, 32)      0           add_2[0][0]
__________________________________________________________________________________________________
conv1d_11 (Conv1D)              (None, 120, 32)      1056        activation_8[0][0]
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 120, 32)      128         conv1d_11[0][0]
__________________________________________________________________________________________________
activation_9 (Activation)       (None, 120, 32)      0           batch_normalization_9[0][0]
__________________________________________________________________________________________________
conv1d_12 (Conv1D)              (None, 120, 32)      11296       activation_9[0][0]
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 120, 32)      128         conv1d_12[0][0]
__________________________________________________________________________________________________
activation_10 (Activation)      (None, 120, 32)      0           batch_normalization_10[0][0]
__________________________________________________________________________________________________
conv1d_13 (Conv1D)              (None, 120, 32)      1056        activation_10[0][0]
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 120, 32)      128         conv1d_13[0][0]
__________________________________________________________________________________________________
add_3 (Add)                     (None, 120, 32)      0           batch_normalization_11[0][0]
                                                                 activation_8[0][0]
__________________________________________________________________________________________________
activation_11 (Activation)      (None, 120, 32)      0           add_3[0][0]
__________________________________________________________________________________________________
conv1d_14 (Conv1D)              (None, 120, 32)      1056        activation_11[0][0]
__________________________________________________________________________________________________
conv1d_1 (Conv1D)               (None, 120, 32)      1056        conv1d[0][0]
__________________________________________________________________________________________________
add_4 (Add)                     (None, 120, 32)      0           conv1d_14[0][0]
                                                                 conv1d_1[0][0]
__________________________________________________________________________________________________
conv1d_15 (Conv1D)              (None, 120, 3)       99          add_4[0][0]
__________________________________________________________________________________________________
activation_12 (Activation)      (None, 120, 3)       0           conv1d_15[0][0]
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, 120, 3)       12          activation_12[0][0]
__________________________________________________________________________________________________
flatten (Flatten)               (None, 360)          0           batch_normalization_12[0][0]
__________________________________________________________________________________________________
dense (Dense)                   (None, 1)            361         flatten[0][0]
==================================================================================================
Total params: 57,912
Trainable params: 57,138
Non-trainable params: 774



__________________________________________________________________________________________________
Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to
==================================================================================================
input_1 (InputLayer)            [(None, 120, 4)]     0
__________________________________________________________________________________________________
conv1d (Conv1D)                 (None, 120, 32)      160         input_1[0][0]
__________________________________________________________________________________________________
conv1d_2 (Conv1D)               (None, 120, 32)      1056        conv1d[0][0]
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, 120, 32)      128         conv1d_2[0][0]
__________________________________________________________________________________________________
activation (Activation)         (None, 120, 32)      0           batch_normalization[0][0]
__________________________________________________________________________________________________
conv1d_3 (Conv1D)               (None, 120, 32)      11296       activation[0][0]
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 120, 32)      128         conv1d_3[0][0]
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 120, 32)      0           batch_normalization_1[0][0]
__________________________________________________________________________________________________
conv1d_4 (Conv1D)               (None, 120, 32)      1056        activation_1[0][0]
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 120, 32)      128         conv1d_4[0][0]
__________________________________________________________________________________________________
add (Add)                       (None, 120, 32)      0           batch_normalization_2[0][0]
                                                                 conv1d[0][0]
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 120, 32)      0           add[0][0]
__________________________________________________________________________________________________
conv1d_5 (Conv1D)               (None, 120, 32)      1056        activation_2[0][0]
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 120, 32)      128         conv1d_5[0][0]
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 120, 32)      0           batch_normalization_3[0][0]
__________________________________________________________________________________________________
conv1d_6 (Conv1D)               (None, 120, 32)      11296       activation_3[0][0]
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 120, 32)      128         conv1d_6[0][0]
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 120, 32)      0           batch_normalization_4[0][0]
__________________________________________________________________________________________________
conv1d_7 (Conv1D)               (None, 120, 32)      1056        activation_4[0][0]
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 120, 32)      128         conv1d_7[0][0]
__________________________________________________________________________________________________
add_1 (Add)                     (None, 120, 32)      0           batch_normalization_5[0][0]
                                                                 activation_2[0][0]
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 120, 32)      0           add_1[0][0]
__________________________________________________________________________________________________
conv1d_8 (Conv1D)               (None, 120, 32)      1056        activation_5[0][0]
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 120, 32)      128         conv1d_8[0][0]
__________________________________________________________________________________________________
activation_6 (Activation)       (None, 120, 32)      0           batch_normalization_6[0][0]
__________________________________________________________________________________________________
conv1d_9 (Conv1D)               (None, 120, 32)      11296       activation_6[0][0]
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 120, 32)      128         conv1d_9[0][0]
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 120, 32)      0           batch_normalization_7[0][0]
__________________________________________________________________________________________________
conv1d_10 (Conv1D)              (None, 120, 32)      1056        activation_7[0][0]
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 120, 32)      128         conv1d_10[0][0]
__________________________________________________________________________________________________
add_2 (Add)                     (None, 120, 32)      0           batch_normalization_8[0][0]
                                                                 activation_5[0][0]
__________________________________________________________________________________________________
activation_8 (Activation)       (None, 120, 32)      0           add_2[0][0]
__________________________________________________________________________________________________
conv1d_11 (Conv1D)              (None, 120, 32)      1056        activation_8[0][0]
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 120, 32)      128         conv1d_11[0][0]
__________________________________________________________________________________________________
activation_9 (Activation)       (None, 120, 32)      0           batch_normalization_9[0][0]
__________________________________________________________________________________________________
conv1d_12 (Conv1D)              (None, 120, 32)      11296       activation_9[0][0]
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 120, 32)      128         conv1d_12[0][0]
__________________________________________________________________________________________________
activation_10 (Activation)      (None, 120, 32)      0           batch_normalization_10[0][0]
__________________________________________________________________________________________________
conv1d_13 (Conv1D)              (None, 120, 32)      1056        activation_10[0][0]
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 120, 32)      128         conv1d_13[0][0]
__________________________________________________________________________________________________
add_3 (Add)                     (None, 120, 32)      0           batch_normalization_11[0][0]
                                                                 activation_8[0][0]
__________________________________________________________________________________________________
activation_11 (Activation)      (None, 120, 32)      0           add_3[0][0]
__________________________________________________________________________________________________
conv1d_14 (Conv1D)              (None, 120, 32)      1056        activation_11[0][0]
__________________________________________________________________________________________________
conv1d_1 (Conv1D)               (None, 120, 32)      1056        conv1d[0][0]
__________________________________________________________________________________________________
add_4 (Add)                     (None, 120, 32)      0           conv1d_14[0][0]
                                                                 conv1d_1[0][0]
__________________________________________________________________________________________________
conv1d_15 (Conv1D)              (None, 120, 3)       99          add_4[0][0]
__________________________________________________________________________________________________
activation_12 (Activation)      (None, 120, 3)       0           conv1d_15[0][0]
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, 120, 3)       12          activation_12[0][0]
__________________________________________________________________________________________________
flatten (Flatten)               (None, 360)          0           batch_normalization_12[0][0]
__________________________________________________________________________________________________
dense (Dense)                   (None, 1)            361         flatten[0][0]
==================================================================================================
Total params: 57,912
Trainable params: 57,138
Non-trainable params: 774